In [1]:
import pandas as pd
import numpy as np

In [2]:
bb=pd.read_csv('bb_w.csv')
fx=pd.read_csv('fx_w.csv')
ub=pd.read_csv('ub_w.csv')
vt=pd.read_csv('vt_w.csv')
iaa=pd.read_csv('iaa2020.csv')

In [3]:
bb.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1929 entries, 0 to 1928
Data columns (total 9 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Rank     1929 non-null   float64
 1   Name     1929 non-null   object
 2   nation   1890 non-null   object
 3   D Score  1929 non-null   float64
 4   E Score  1929 non-null   float64
 5   Pen.     1764 non-null   float64
 6   Total    1929 non-null   float64
 7   year     1929 non-null   int64
 8   round    1929 non-null   object
dtypes: float64(5), int64(1), object(3)
memory usage: 135.8+ KB

In [4]:
usw=pd.read_csv('../../Data/cleandata22-23/usa22_23.csv')

In [5]:
usw=usw.drop(columns=['Gender', 'Competition', 'Round', 'Location', 'Date'])

In [6]:
wbb = usw[usw['Apparatus'] == 'BB']

In [7]:
wbb.info()

<class 'pandas.core.frame.DataFrame'>
Index: 163 entries, 0 to 657
Data columns (total 9 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         163 non-null    object
 1   Country      163 non-null    object
 2   Apparatus    163 non-null    object
 3   Rank         163 non-null    float64
 4   D_Score      163 non-null    float64
 5   E_Score      163 non-null    float64
 6   Penalty      163 non-null    float64
 7   Score        163 non-null    float64
 8   Total_Score  163 non-null    float64
dtypes: float64(6), object(3)
memory usage: 12.7+ KB

In [8]:
wub = usw[usw['Apparatus'] == 'UB']

In [9]:
wvt = usw[usw['Apparatus'] == 'VT']

In [10]:
wfx = usw[usw['Apparatus'] == 'FX']

In [11]:
wbb.columns

Index(['Name', 'Country', 'Apparatus', 'Rank', 'D_Score', 'E_Score', 'Penalty',
       'Score', 'Total_Score'],
      dtype='object')

In [12]:
wvt.columns

Index(['Name', 'Country', 'Apparatus', 'Rank', 'D_Score', 'E_Score', 'Penalty',
       'Score', 'Total_Score'],
      dtype='object')

In [14]:
wvt

,Name,Country,Apparatus,Rank,D_Score,E_Score,Penalty,Score,Total_Score
6,ciena alipio,USA,VT,0.0,4.6,7.65,0.3,11.95,11.95
7,ciena alipio,USA,VT,0.0,4.6,8.70,0.1,13.20,13.20
11,ciena alipio,USA,VT,0.0,4.6,8.70,0.1,13.20,13.20
19,sydney barros,USA,VT,0.0,4.2,8.90,0.0,13.10,13.10
26,simone biles,USA,VT,0.0,6.4,9.80,0.5,15.70,15.70
...,...,...,...,...,...,...,...,...,...
644,lexi zeiss,USA,VT,0.0,4.6,9.10,0.0,13.70,13.70
648,lexi zeiss,USA,VT,0.0,5.0,8.45,0.0,13.45,13.45
655,alicia zhou,USA,VT,0.0,4.2,9.00,0.0,13.20,13.20
656,alicia zhou,USA,VT,0.0,4.2,9.20,0.0,13.40,13.40
660,alicia zhou,USA,VT,0.0,4.2,8.70,0.0,12.90,12.90

In [15]:
wvt=wvt.drop(columns=['D_Score', 'E_Score', 'Penalty',])

In [16]:
vt=vt.drop(columns=['D', 'E', 'ND', 'Total', 'D2', 'E2', 'ND2',
       'Total2'])

In [17]:
vt.columns

Index(['Rank', 'Athlete', 'Nation', 'Average', 'year', 'round'], dtype='object')

In [18]:
column_name_mapping = {
    'Athlete': 'Name',
    'Nation': 'nation',
    'Average': 'Total',
}

# Use the 'rename' method to rename the columns
vt = vt.rename(columns=column_name_mapping)

In [20]:
wvt

              Name Country Apparatus  Rank  Score  Total_Score
6     ciena alipio     USA        VT   0.0  11.95        11.95
7     ciena alipio     USA        VT   0.0  13.20        13.20
11    ciena alipio     USA        VT   0.0  13.20        13.20
19   sydney barros     USA        VT   0.0  13.10        13.10
26    simone biles     USA        VT   0.0  15.70        15.70
..             ...     ...       ...   ...    ...          ...
644     lexi zeiss     USA        VT   0.0  13.70        13.70
648     lexi zeiss     USA        VT   0.0  13.45        13.45
655    alicia zhou     USA        VT   0.0  13.20        13.20
656    alicia zhou     USA        VT   0.0  13.40        13.40
660    alicia zhou     USA        VT   0.0  12.90        12.90

[152 rows x 6 columns]

In [19]:
vt

      Rank                 Name nation   Total    year  round
0      1.0            Liu Jinru    CHN  14.283  2018.0  final
1      2.0   Angelina Melnikova    RUS  14.267  2018.0  final
2      3.0  Eleonora Afanasyeva    RUS  14.217  2018.0  final
3      4.0       Denisa Golgota    ROU  14.067  2018.0  final
4      5.0       Grace McCallum    USA  14.017  2018.0  final
...    ...                  ...    ...     ...     ...    ...
1622   4.0    Noel van Klaveren    NED  14.866  2015.0  final
1623   5.0         Ellie Downie    GBR  14.516  2015.0  final
1624   6.0    Claudia Fragapane    GBR  14.083  2015.0  final
1625   7.0         Camille Bahl    FRA  14.066  2015.0  final
1626   8.0           Teja Belak    SLO  13.216  2015.0  final

[1627 rows x 6 columns]

In [21]:
column_name_mapping = {
    'Country': 'nation',
    'D_Score': 'D Score',
    'E_Score': 'E Score',
    'Penalty': 'Pen.',
    'Score': 'Total'
    
}

# Use the 'rename' method to rename the columns
wbb = wbb.rename(columns=column_name_mapping)
wvt = wvt.rename(columns=column_name_mapping)
wub = wub.rename(columns=column_name_mapping)
wfx = wfx.rename(columns=column_name_mapping)

In [22]:
wbb=wbb.drop(columns=['Total_Score', 'Apparatus'])

In [23]:
wub=wub.drop(columns=['Total_Score', 'Apparatus'])
wvt=wvt.drop(columns=['Total_Score', 'Apparatus'])
wfx=wfx.drop(columns=['Total_Score', 'Apparatus'])

In [25]:
wvt

              Name nation  Rank  Total
6     ciena alipio    USA   0.0  11.95
7     ciena alipio    USA   0.0  13.20
11    ciena alipio    USA   0.0  13.20
19   sydney barros    USA   0.0  13.10
26    simone biles    USA   0.0  15.70
..             ...    ...   ...    ...
644     lexi zeiss    USA   0.0  13.70
648     lexi zeiss    USA   0.0  13.45
655    alicia zhou    USA   0.0  13.20
656    alicia zhou    USA   0.0  13.40
660    alicia zhou    USA   0.0  12.90

[152 rows x 4 columns]

In [26]:
new_column_order = ['Rank', 'Name', 'nation', 'D Score', 
                    'E Score', 'Pen.', 'Total']

# Rearrange the DataFrame columns based on the new order
wbb = wbb[new_column_order]
wub = wub[new_column_order]
# wvt = wvt[new_column_order]
wfx = wfx[new_column_order]

In [27]:
bb = bb[bb['year'] > 2020]
vt = vt[vt['year'] > 2020]
ub = ub[ub['year'] > 2020]
fx = fx[fx['year'] > 2020]

In [30]:
wvt.head()

             Name nation  Rank  Total
6    ciena alipio    USA   0.0  11.95
7    ciena alipio    USA   0.0  13.20
11   ciena alipio    USA   0.0  13.20
19  sydney barros    USA   0.0  13.10
26   simone biles    USA   0.0  15.70

In [32]:
bb=bb.drop(columns=['year', 'round'])
fx=fx.drop(columns=['year', 'round'])
ub=ub.drop(columns=['year', 'round'])
vt=vt.drop(columns=['year', 'round'])

KeyError: "['year', 'round'] not found in axis"

In [34]:
dfbb = pd.concat([wbb, bb], axis=0)
dfub = pd.concat([wub, ub], axis=0)
dffx = pd.concat([wfx, fx], axis=0)
dfvt = pd.concat([wvt, vt], axis=0)

In [35]:
dfbb = dfbb.drop_duplicates()
dfub = dfub.drop_duplicates()
dffx = dffx.drop_duplicates()
dfvt = dfvt.drop_duplicates()

In [ ]:
dfbb.info()

In [36]:
usa_bb = dfbb[dfbb['nation']== 'USA']
usa_ub = dfub[dfub['nation']== 'USA']
usa_fx = dffx[dffx['nation']== 'USA']
usa_vt = dfvt[dfvt['nation']== 'USA']

In [38]:
usa_ub['Name'] = usa_ub['Name'].str.lower()
usa_bb['Name'] = usa_bb['Name'].str.lower()
usa_fx['Name'] = usa_fx['Name'].str.lower()
usa_vt['Name'] = usa_vt['Name'].str.lower()

/var/folders/j_/555m2zps099832fjh_m8jjnc0000gn/T/ipykernel_25820/916601040.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  usa_ub['Name'] = usa_ub['Name'].str.lower()
/var/folders/j_/555m2zps099832fjh_m8jjnc0000gn/T/ipykernel_25820/916601040.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  usa_bb['Name'] = usa_bb['Name'].str.lower()
/var/folders/j_/555m2zps099832fjh_m8jjnc0000gn/T/ipykernel_25820/916601040.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  usa_fx['Name'] = usa_fx['Name'].str.lower()
/var/folders/j_/555m2zps099832fjh_m8jjnc0000gn/T/ipykernel_25820/916601040.py:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  usa_vt['Name'] = usa_vt['Name'].str.lower()

In [39]:
bbt=usa_bb.sort_values(by='Total', ascending=False)

In [40]:
ubt=usa_ub.sort_values(by='Total', ascending=False)

In [41]:
fxt=usa_fx.sort_values(by='Total', ascending=False)

In [42]:
vtt=usa_vt.sort_values(by='Total', ascending=False)

In [43]:
bbtz = bbt.head(15)

In [44]:
ubtz=ubt.head(15)

In [45]:
ubt.head(15)

     Rank           Name nation  D Score  E Score  Pen.   Total
263   0.0  shilese jones    USA      6.3    8.700   0.0  15.000
262   0.0  shilese jones    USA      6.3    8.600   0.0  14.900
254   0.0  shilese jones    USA      6.3    8.550   0.0  14.850
667   1.0     zoe miller    USA      6.4    8.450   0.0  14.850
363   1.0     zoe miller    USA      6.4    8.450   0.0  14.850
238   2.0  shilese jones    USA      6.4    8.366   0.0  14.766
444   2.0  shilese jones    USA      6.4    8.366   0.0  14.766
362   1.0     zoe miller    USA      6.4    8.233   0.0  14.633
666   1.0     zoe miller    USA      6.4    8.233   0.0  14.633
239   5.0  shilese jones    USA      6.3    8.266   0.0  14.566
445   5.0  shilese jones    USA      6.3    8.266   0.0  14.566
411   0.0     zoe miller    USA      6.4    8.000   0.0  14.400
44    0.0   skye blakely    USA      5.9    8.500   0.0  14.400
237   1.0  shilese jones    USA      6.3    8.066   0.0  14.366
443   1.0  shilese jones    USA      6.3    8.066   0.0  14.366

In [46]:
fxtz=fxt.head(15)

In [47]:
vttz=vtt.head(15)

In [48]:
bbs = bbt[['Name']].drop_duplicates()

In [49]:
ubs = ubt[['Name']].drop_duplicates()

In [50]:
fxs = fxt[['Name']].drop_duplicates()

In [53]:
vts = vtt[['Name']].drop_duplicates()

In [54]:
ubtz['Name'].unique()

array(['shilese jones', 'zoe miller', 'skye blakely'], dtype=object)

In [55]:
fxtz['Name'].unique()

array(['simone biles', 'kaliya lincoln', 'shilese jones', 'jade carey',
       'joscelyn roberson', 'jordan chiles'], dtype=object)

In [56]:
bbtz['Name'].unique()

array(['simone biles', 'konnor mcclain', 'shilese jones', 'skye blakely',
       'sunisa lee', 'ciena alipio', 'tiana sumanasekera',
       'ashlee sullivan', 'kayla dicello'], dtype=object)

In [57]:
vttz['Name'].unique()

array(['simone biles', 'jade carey', 'joscelyn roberson', 'shilese jones',
       'jordan chiles', 'konnor mcclain'], dtype=object)

In [58]:
sorted_names = ['simone biles', 'konnor mcclain', 'shilese jones', 'skye blakely',
       'sunisa lee', 'ciena alipio', 'tiana sumanasekera',
       'ashlee sullivan', 'kayla dicello']

# Filter the DataFrame based on the list of names
bb_names = usa_bb[usa_bb['Name'].isin(sorted_names)]

In [59]:
sorted_names=['shilese jones', 'zoe miller', 'skye blakely']

# Filter the DataFrame based on the list of names
ub_names = usa_ub[usa_ub['Name'].isin(sorted_names)]

In [60]:
sorted_names = ['simone biles', 'kaliya lincoln', 'shilese jones', 'jade carey',
       'joscelyn roberson', 'jordan chiles']

# Filter the DataFrame based on the list of names
fx_names = usa_fx[usa_fx['Name'].isin(sorted_names)]

In [61]:
sorted_names =['simone biles', 'jade carey', 'joscelyn roberson', 'shilese jones',
       'jordan chiles', 'konnor mcclain']

# Filter the DataFrame based on the list of names
vt_names = usa_vt[usa_vt['Name'].isin(sorted_names)]

In [62]:
average_totals = bb_names.groupby('Name')['Total'].mean()

# Create a new DataFrame from the Series
average_totals_df = average_totals.reset_index(name='Average Total')

In [63]:
bb=average_totals_df.sort_values(by='Average Total', ascending=False)

In [64]:
average_totals = ub_names.groupby('Name')['Total'].mean()

# Create a new DataFrame from the Series
average_totals_df = average_totals.reset_index(name='Average Total')

In [65]:
ub=average_totals_df.sort_values(by='Average Total', ascending=False)

In [66]:
average_totals = fx_names.groupby('Name')['Total'].mean()

# Create a new DataFrame from the Series
average_totals_df = average_totals.reset_index(name='Average Total')

In [67]:
fx=average_totals_df.sort_values(by='Average Total', ascending=False)

In [68]:
average_totals = vt_names.groupby('Name')['Total'].mean()

# Create a new DataFrame from the Series
average_totals_df = average_totals.reset_index(name='Average Total')

In [69]:
vt=average_totals_df.sort_values(by='Average Total', ascending=False)

In [77]:
bb = bb.head(6)

In [86]:
bb['apparatus']='bb'

/var/folders/j_/555m2zps099832fjh_m8jjnc0000gn/T/ipykernel_25820/2453902602.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  bb['apparatus']='bb'

In [87]:
ub['apparatus']='ub'

In [88]:
fx['apparatus']='fx'

In [89]:
vt['apparatus']='vt'

In [90]:
fx

                Name  Average Total apparatus
5       simone biles       15.10000        fx
4      shilese jones       13.93750        fx
3     kaliya lincoln       13.90000        fx
1      jordan chiles       13.83325        fx
0         jade carey       13.82800        fx
2  joscelyn roberson       13.47075        fx

In [91]:
vt

                Name  Average Total apparatus
5       simone biles      15.275000        vt
0         jade carey      14.520222        vt
4      shilese jones      14.352286        vt
1      jordan chiles      14.288667        vt
3     konnor mcclain      14.283333        vt
2  joscelyn roberson      14.002385        vt

In [92]:
top_women = pd.concat([bb, ub,fx, vt], axis=0)

In [93]:
top_women

                 Name  Average Total apparatus
5        simone biles      14.650000        bb
3      konnor mcclain      14.525000        bb
7          sunisa lee      13.925000        bb
6        skye blakely      13.543000        bb
4       shilese jones      13.312500        bb
8  tiana sumanasekera      13.087500        bb
0       shilese jones      14.574600        ub
2          zoe miller      13.836600        ub
1        skye blakely      13.320222        ub
5        simone biles      15.100000        fx
4       shilese jones      13.937500        fx
3      kaliya lincoln      13.900000        fx
1       jordan chiles      13.833250        fx
0          jade carey      13.828000        fx
2   joscelyn roberson      13.470750        fx
5        simone biles      15.275000        vt
0          jade carey      14.520222        vt
4       shilese jones      14.352286        vt
1       jordan chiles      14.288667        vt
3      konnor mcclain      14.283333        vt
2   joscelyn roberson      14.002385        vt

In [95]:
top_women.to_csv('top_women.csv', index=False)